~ Node
const message = 'NodeJS is amazing!'

console.log(message)
// ctrl + ~   -  запустить терминал 
//  mkdir css -создаст папку 
// mkdir css/global - создаст папку внутри папкиещгср 
// touch main.css - создаст файл
// touch css/global/global.css - создаст файл внутри єтих папок

// ls - list
// cd - навигація(путь надо четко писать)
// cd C: -перейти на диск С
//  ../ - навигация наверх от файла к диску
//  / - навигация в глубину от диска к папке и к файлу
// pwd - посмотреть путь (текущая директория)
// rm - удалить 
// rm -rf css/global - удалить внутри папки другу папку и то, что в ней

//  mv - переименовать/ переместить
// mv main.css css - переместить файл main.css а папку css
// clear - очистить


// node -v - посмотреть какая версия
