console.log('Hi from Node.js!!!')

// node app.js - щоб подивитись консоль, не запускаючи браузер

// npm -v - посмотреть версию npm 
// npm - єто приложение, которое дает возможность подключать библиотеки 
// npm init - в проекте делается один раз и эта команда инициализирует npm  в текущей папке (проекте)
// About to write to D:\Demorepositori\goit-js-module-08-repeta\goit-js-module-08-repeta\package.json: єта фраза говорит, что сейчас будет установлен package.json в мою программу
// Is this OK? (yes) - нажимаем  у - и package.json будет установлен
// npm init -y -- сразу создаст package.json без проклацивания по пунктам

//  создастся файл  package.json  со служебной информацией
// он похож на джава скрипт об'єкт: у него есть ключ "name": -ОБЯЗАТЕЛЬНО в двойніх кавічках ""
//  и значение ключа "goit-js-module-08-repeta", - может біть что угодно: строка, буль, НО НЕ ФУНкция!!!!